import { CCTermsWrap } from './style';

const CCTerms = () => {
  return (
    <CCTermsWrap>
      <div className="title">
        <h2>서비스 이용약관</h2>
        <p>2025-01-24</p>
      </div>
      <div className="termsContent">
        <p>Viewee 서비스 이용약관 </p>
        <p>제1장 총칙</p>{' '}
        <p>
          제1조 (목적) 본 약관은 회사가 제공하는 Viewee 서비스(이하 "서비스"라 합니다)의 이용과 관련하여 회사와 회원
          간의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.
        </p>
        <p> 제2조 (용어의 정의)</p>
        <div>
          <ol>
            <li>"회사"란 Viewee 서비스를 제공하는 사업자를 말합니다.</li>
            <li>"회원"이란 본 약관에 동의하고 회사와 서비스 이용계약을 체결한 자를 말합니다.</li>
            <li>"서비스"란 회사가 제공하는 Viewee 관련 제반 서비스를 말합니다.</li>
            <li>
              "아이디(ID)"란 회원의 식별과 서비스 이용을 위하여 회원이 정하고 회사가 승인하는 문자와 숫자의 조합을
              말합니다.
            </li>
          </ol>
        </div>
        <p>제3조 (약관의 게시와 개정)</p>
        <div>
          <ol>
            <li>회사는 본 약관의 내용을 회원이 쉽게 알 수 있도록 서비스 초기 화면에 게시합니다.</li>
            <li>회사는 관련법령을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.</li>
            <li>
              회사가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 서비스 초기화면에 그
              적용일자 7일 이전부터 공지합니다.
            </li>
          </ol>
        </div>
        <p>제2장 서비스 이용계약</p>
        <p>제4조 (이용계약의 체결)</p>
        <div>
          <ol>
            <li>
              이용계약은 회원이 되고자 하는 자(이하 "가입신청자")가 약관의 내용에 대하여 동의를 한 다음 회원가입신청을
              하고 회사가 이러한 신청에 대하여 승낙함으로써 체결됩니다.
            </li>
            <li>
              회사는 가입신청자의 신청에 대하여 서비스 이용을 승낙함을 원칙으로 합니다. 다만, 다음 각 호에 해당하는
              신청에 대하여는 승낙을 하지 않을 수 있습니다.
              <ul>
                <li>가입신청자가 본 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우</li>
                <li>실명이 아니거나 타인의 명의를 이용한 경우</li>
                <li>허위의 정보를 기재하거나, 회사가 제시하는 내용을 기재하지 않은 경우</li>
              </ul>
            </li>
          </ol>
        </div>
        <p>제3장 회원의 의무</p>
        <p>제5조 (회원의 의무)</p>
        <div>
          <ol>
            <li>
              회원은 본 약관에서 규정하는 사항과 기타 회사가 정한 제반 규정, 공지사항 등 회사가 공지하는 사항을
              준수하여야 합니다.
            </li>
            <li>
              회원은 회사의 명시적 동의가 없는 한 서비스의 이용권한, 기타 이용계약상의 지위를 타인에게 양도, 증여할 수
              없으며 이를 담보로 제공할 수 없습니다.
            </li>
            <li>
              회원은 서비스 이용과 관련하여 다음 각 호의 행위를 하여서는 안됩니다.
              <ul>
                <li>서비스 신청 또는 변경 시 허위내용의 등록</li>
                <li>타인의 정보도용</li>
                <li>회사가 게시한 정보의 변경</li>
                <li>서비스를 이용하여 얻은 정보를 회사의 사전 승낙 없이 복제 또는 유통시키는 행위</li>
              </ul>
            </li>
          </ol>
        </div>
        <p>제4장 서비스 제공 및 이용</p>
        <p>제6조 (서비스의 제공)</p>
        <div>
          <ol>
            <li>
              회사는 다음과 같은 서비스를 제공합니다.
              <ul>
                <li>Viewee 플랫폼 이용 서비스</li>
                <li>기타 회사가 추가 개발하거나 다른 회사와의 제휴계약 등을 통해 회원에게 제공하는 일체의 서비스</li>
              </ul>
            </li>
            <li>회사는 서비스를 일정범위로 분할하여 각 범위 별로 이용가능시간을 별도로 지정할 수 있습니다.</li>
          </ol>
        </div>
        <p>제7조 (서비스의 중단)</p>
        <div>
          <ol>
            <li>
              회사는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신두절 또는 운영상 상당한 이유가 있는 경우
              서비스의 제공을 일시적으로 중단할 수 있습니다.
            </li>
            <li>
              회사는 제1항의 사유로 서비스의 제공이 일시적으로 중단됨으로 인하여 이용자 또는 제3자가 입은 손해에 대하여
              배상합니다. 단, 회사가 고의 또는 과실이 없음을 입증하는 경우에는 그러하지 아니합니다.
            </li>
          </ol>
        </div>
        <p>제5장 개인정보보호</p>
        <p>제8조 (개인정보의 보호 및 사용)</p>
        <div>
          <ol>
            <li>회사는 관련법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위해 노력합니다.</li>
            <li>
              회사는 서비스의 제공과 관련하여 취득한 회원의 개인정보를 본인의 승낙 없이 제3자에게 누설하거나 배포할 수
              없으며, 상업적 목적으로 사용할 수 없습니다.
            </li>
          </ol>
        </div>
        <p>제6장 계약해지 및 이용제한</p>
        <p>제9조 (계약해지 및 이용제한)</p>
        <div>
          <ol>
            <li>
              회원이 이용계약을 해지하고자 하는 때에는 회원 본인이 온라인을 통하여 회사에 해지신청을 하여야 합니다.
            </li>
            <li>
              회사는 회원이 다음 각 호에 해당하는 행위를 하였을 경우 사전통지 없이 이용계약을 해지하거나 또는 기간을
              정하여 서비스 이용을 중지할 수 있습니다.
              <ul>
                <li>타인의 서비스 ID 및 비밀번호를 도용한 경우</li>
                <li>서비스 운영을 고의로 방해한 경우</li>
                <li>가입한 이름이 실명이 아닌 경우</li>
                <li>같은 사용자가 다른 ID로 이중등록을 한 경우</li>
                <li>공공질서 및 미풍양속에 저해되는 내용을 고의로 유포시킨 경우</li>
              </ul>
            </li>
          </ol>
        </div>
        <p>제7장 손해배상 등</p>
        <p>제10조 (손해배상)</p>
        <div>
          <ol>
            <li>
              회사는 서비스 이용과 관련하여 회원에게 발생한 손해 중 회사의 고의나 과실이 있는 경우에 한하여 통상손해를
              배상할 책임이 있습니다.
            </li>
            <li>
              회원이 본 약관을 위반하여 회사에 손해를 끼친 경우, 회원은 회사에 대하여 그 손해를 배상할 책임이 있습니다.
            </li>
          </ol>
        </div>
        <p>제8장 기타</p>
        <p>제11조 (분쟁해결)</p>
        <div>
          <ol>
            <li>본 약관은 대한민국법령에 의하여 규정되고 이행됩니다.</li>
            <li>
              서비스 이용과 관련하여 회사와 회원 간에 발생한 분쟁에 대해서는 민사소송법상의 주소지를 관할하는 법원을
              합의관할로 합니다.
            </li>
          </ol>
        </div>
        <p>부칙</p>
        <p>제1조 (시행일) 본 약관은 2025년 01월 24일부터 시행합니다.</p>
      </div>
    </CCTermsWrap>
  );
};

export default CCTerms;
